Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ལེགས་སོ་ལེགས་སོ།
en: Respected Blessed One, this is excellent!

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐོགས་པ་མ་མཆིས་པའི་ཡེ་ཤེས་གཟིགས་པ་ནི་ངོ་མཚར་ལགས་སོ།
en: The unimpeded wisdom vision of the blessed buddhas is amazing!

source: །མཆོག་ཏུ་ངོ་མཚར་ལགས་སོ།
en: It is truly amazing!

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་རྣམས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་མཁྱེན་པ་ལགས་སོ། །དབང་པོ་ལ་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལགས།
en: Respected Blessed One, the thus-gone ones know the inclinations of all sentient beings, and they have perfected the expertise related to their faculties.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་རོས་ཚིམ་པར་མཛད་པ་ལགས། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟོན་པར་མཛད་པ་ལགས།
en: They satisfy all sentient beings with the taste of the Dharma, they reveal the eightfold path of the noble ones, and they pacify all forms of suffering.

source: སྡུག་བསྔལ་ཐམས་ཅད་ཉེ་བར་ཞི་བར་མཛད་པ་ལགས་པས་སུ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ལ་དད་པ་མི་སྐྱེད་པ་ལགས།
en: Therefore, who would not generate faith in this unsurpassed and perfect awakening?”

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱིས་ཐལ་མོ་རབ་ཏུ་སྦྱར་ནས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གང་དང་གང་དུ་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་འདི་བསྟན་པ་ཐ་ན་གླེགས་བམ་དུ་ཆུད་པ་ལ་ཡང་རུང་སྟེ། དེ་དང་དེར་བདག་ཅག་གིས་བརྩོན་པ་ལྷུར་བླང་བའི་ཐབས་ཐམས་ཅད་ཀྱིས་བཀུར་སྟིར་བགྱིའོ། །རི་མོར་བགྱིའོ། །མཆོད་པར་བགྱིའོ།
en: Joining their palms together, the gods, nāgas, yakṣas, asuras, garuḍas, kinnaras, and mahoragas then exclaimed in unison, “Respected Blessed One, we shall diligently and by all means revere, honor, and worship any place where this dhāraṇī mantra that accords with the truth is taught—even if it just written in a book.

source: །ཆོས་སྨྲ་བ་དང་ཆོས་ཉན་པ་དེ་དག་དང་། གནས་དེ་དག་ལ་སླར་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་རྫི་བར་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ། །བསྲུང་བར་བགྱིའོ། །སྦ་བར་བགྱིའོ།
en: We shall nurture, guard, and protect those who preach the Dharma and those who listen to it, as well as their dwelling places, so that they remain free from harm by any of their opponents.

source: །ནོར་གྱི་ཕུང་པོ་ཐམས་ཅད་ཀྱིས་མི་ཕོངས་པར་བགྱིའོ། །རྟག་པར་སྣོད་དུ་གྱུར་ཅིང་སྦྱིན་གནས་སུ་གྱུར་ལ།
en: We shall ensure that they never lack wealth and that they always remain proper recipients and objects of generosity.

source: ཚོགས་པ་རྣམས་ནད་མ་མཆིས་པ་དང་། ལོངས་སྤྱོད་དང་ཉེ་བར་སྤྱོད་པས་དགའ་ཞིང་རྩེ་སྟེ།
en: We shall ensure that those assemblies remain free from disease. We shall ensure that they will enjoy, relish, and find great pleasure in their things and possessions.

source: མཆོག་ཏུ་དགའ་བ་མང་ལ་ཆོས་འཚལ་ཞིང་ཆོས་ཀྱིས་གནས་པ་དག་དང་། ཆོས་རྗེས་སུ་བསྲུང་བར་བགྱིའོ།
en: We shall protect, in accordance with the Dharma, those who pursue the Dharma and abide by it!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱེད་གང་དག་ཆོས་ཀྱི་ཚུལ་དང་དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་གཅད་པར་བྱ་བའི་ཕྱིར་ཞུགས་པ་ནི་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་སྦྱིན་བདག་ཁྱེད་ལེགས་སོ་ལེགས་སོ།།
en: The Blessed One replied, “Benefactors of the Buddha’s teachings, your engagements, made to ensure that the Dharma way and the lineage of the Three Jewels remain uninterrupted, are excellent!”

source: ཡང་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་རབ་ཏུ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་དེས་གང་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོའི་ལག་ནས་འདིར་ཡིད་ལ་བྱེད་པ་བསྐུར་ཞིང་། ལུང་བསྟན་པ་ཆེན་པོ་ཉི་མའི་སྙིང་པོ་ལ་དད་པ་སྦྱིན་པར་མཛད་པ། རིག་པ་མཆིས་པའི་སྦུབས་ཞི་བ་སྡང་བ་གཉིད་ཀྱིས་ལོག་པར་བགྱིད་པའི་གཟུངས་སྔགས་བཤད་དུ་གསོལ།
en: At that moment, Venerable Śāriputra bowed with his palms joined in the direction of the Blessed One and said, “Respected Blessed One, please explain to us the dhāraṇī mantra that the thus-gone Glorious Essence of Flowers intended to confer here through the bodhisattva Ākāśagarbha—the dhāraṇī mantra that bestows faith in this great instruction of The Quintessence of the Sun, the peaceful core of knowledge that puts hostile beings to sleep!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་མདུན་དུ་བཤད་པར་བྱའོ། །ཤཱ་རིའི་བུ་དེའི་ཕྱིར་ཁྱོད་ཉོན་ལ་ཞེས་བྱ་བ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “Śāriputra,” replied the Blessed One, “I will explain this in the presence of the world with its gods. Therefore, Śāriputra, listen!” [. . .]

source: །ཤཱ་རིའི་བུ་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་དེ་དེ་ལྟ་བུའི་ཐག་རིང་པོ་ནས་འདིར་ཁྱེད་ཀྱི་བསམ་པ་དང་བག་ལ་ཉལ་བ་མཁྱེན་ནས་འདིར་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་ཁྱེད་བདག་ཏུ་འདུ་ཤེས་པ་དང་། སེམས་ཕྱིན་ཅི་ལོག་པ་དང་། འཁོར་བའི་འདམ་ལ་ཀུན་ཏུ་རྨོངས་པ་དང་། ལམ་ཡན་ལག་བརྒྱད་པ་ལ་རྣམ་པར་རྨོངས་པས་གཟུངས་སྔགས་དེ་ལྟ་བུ་འདིར་བསྐུལ་བ་ཡིན་ནོ།
en: The Blessed One then said, “Śāriputra, from far away, the thus-gone Glorious Essence of Flowers knows your inclinations and latent tendencies. He has conferred that dhāraṇī mantra in this buddha realm because you adhere to the perception of a self, your mind entertains mistaken views, you are thoroughly confused within the swamp of saṃsāra, and you are utterly deluded with respect to the eightfold path of the noble ones.

source: །ཇི་ལྟར་བདག་མེད་པ་ཡིན་ཡང་འོན་ཀྱང་འདི་ན་སེམས་ཅན་བྱིས་པ་རྣམས་བདག་ཡོངས་སུ་བཙལ་བར་སེམས་ཕྱིན་ཅི་ལོག་པ་དག་ཡིན་ནོ།
en: In this place, although phenomena are selfless, immature beings mistakenly pursue a sense of self.

source: །ཤཱ་རིའི་བུ་མཁས་པ་ཇི་ལྟར་བདག་ཡོངས་སུ་ཚོལ་བར་བྱེད་ཅེ་ན།
en: “Śāriputra, how do the wise ones investigate the self?

source: ཇི་ལྟར་བདག་མེད་པ་བཞིན་དུ་བདག་ཉིད་ཀྱིས་མངོན་སུམ་དུ་འགྱུར་རོ།
en: They directly perceive it in accordance with the absence of self.

source: །ཤཱ་རིའི་བུ་མཁས་པས་འདི་ལ་འདི་ལྟར་བདག་ཡོངས་སུ་བཙལ་བར་བྱ་སྟེ།
en: Śāriputra, in this place, the wise ones should investigate the self in the following way:

source: སེམས་ཅན་འདི་རྣམས་ནི་རང་གི་ལུས་ལ་བདག་ཏུ་འདུ་ཤེས་པ་དག་ཡིན་པས་ལུས་འདི་ཉིད་ལ་ཚུལ་བཞིན་དུ་སོ་སོར་བརྟག་པར་བྱའོ།
en: since these beings entertain the notion of a self with respect to their bodies, they should examine their bodies properly.

source: དབང་པོ་ཁོ་ནར་མིག་ལ་སོ་སོར་བརྟག་པར་བྱའོ། །འདི་ལྟར་ཡང་དག་པར་བརྟག་པར་བྱ་སྟེ། འདི་ལྟར་གནས་མལ་སྣ་ཚོགས་ལ་སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་ནས་དབང་པོ་ཐམས་ཅད་བསྡམས་པའི་རང་གི་སེམས་ཀྱིས་འདི་ལྟར་བརྟག་པར་བྱའོ།
en: Concerning the sense faculties alone, they should investigate their eyes while sitting cross-legged on their various seats with all their faculties restrained.

source: །བདག་གི་མིག་གཡས་པ་འདི་ནི་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པ།
en: They should think, ‘My right eye is made of the four great elements.

source: རྒྱུས་པས་འབྲེལ་པ་ཆུས་གང་བ་ཡིན་ཏེ།
en: It is connected with ligaments and filled with water.

source: སྒྱུར་བར་བྱེད་པ་གཞན་གང་ཡང་མེད་ཀྱི་རླུང་རྣམས་ཡིན་ནོ།
en: Only the winds control its movements.

source: །གང་དག་མིག་གི་དབང་པོར་ཞུགས་ནས་སྐོར་བར་བྱེད་ཅིང་སྒྱུར་བར་བྱེད་པ་དེ་དག་ཀྱང་རླུང་རྣམས་སོ།
en: When they enter the eye faculty, the winds cause the eye to roll and move.

source: །ཡོངས་སུ་སྦྱོང་བར་བྱེད་ཅིང་འབྱུང་བར་བྱེད་པ་དེ་དག་ནི་ནམ་མཁའ་ལ་རྟེན་པ་དག་གོ།
en: Those winds that control the eye and produce its manifestations are in turn supported by space.

source: །ནམ་མཁའ་དེ་ཡང་གཟུང་བ་མེད་པ། བརྗོད་དུ་མེད་པ། བདག་མེད་པའོ།
en: Space is inapprehensible—it is inexpressible and selfless.

source: །ཇི་ལྟར་ནམ་མཁའ་བདག་མེད་པ་དེ་བཞིན་དུ་རླུང་དེ་དག་ཀྱང་བདག་མེད་པའོ། །གང་དག་མིག་གི་དབང་པོ་ལ་འཇུག་ཅིང་སྐོར་བར་བྱེད། སྒྱུར་བར་བྱེད། ཡོངས་སུ་སྦྱོང་བར་བྱེད། འབྱུང་བར་བྱེད་པ་དེ་དག་ཀྱང་གཟུང་བ་མེད་པ། བརྗོད་དུ་མེད་པ། བདག་མེད་པ། དམིགས་པ་དང་བྲལ་བ་དག་གོ། །
en: Just as space is selfless, so too are the winds. Those winds that enter the eye faculty, make it roll, control its movements, control it, and produce its manifestations are also inapprehensible, inexpressible, selfless, and beyond observation.’

source: དེ་བཞིན་དུ་གང་མིག་གི་དབང་པོ་ལ་སའི་ཁམས་སྲ་བ་ཉིད་ཤིང་ནྱ་གྲོ་དྷའི་ས་བོན་ཙམ་ཡོད་པ་ཡང་མིག་ཐམས་ཅད་ལ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་སྐྱེ་བས་སོ་སོར་བརྟགས་ནས་དེ་བདག་ཏུ་མི་དམིགས་སོ།
en: “Likewise, those who investigate the entire eye by correctly considering the earth element present within the eye faculty, which is solid and the mere size of a banyan seed, will not apprehend a self.

source: །དེ་ལ་བདག་ཉིད་ཀྱིས་ནེམ་ནུར་མེད་པར་འགྱུར་རོ།
en: They will be free from doubts about this.

source: །དེ་ལ་སའི་ཁམས་ལ་བདག་མེད་དེ། ཁམས་དེ་ཡང་གཟུང་བ་མེད་པ་བདག་མེད་པར་དམིགས་སོ།
en: The earth element is selfless—it is found to be inapprehensible and selfless.

source: །དེ་བཞིན་དུ་དེ་ལ་ཆུའི་ཁམས་ལ་སོ་སོར་རྟོག་པར་བྱེད་དོ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་དུ་མེའི་ཁམས་ཀྱི་བར་ལ་སོ་སོར་རྟོག་པར་བྱེད་དོ།
en: In the same way, they will investigate the elements from the water element to the fire element.

source: །དེ་ལྟར་མིག་གི་བར་ལ་སོ་སོར་བརྟགས་པས་མིག་གི་འབྱུང་བ་ཆེན་པོ་རྣམས་ལ་བདག་མེད་པར་བདག་ཉིད་ཁོ་ནས་ནེམ་ནུར་མེད་པར་འགྱུར་རོ། །
en: By investigating the eye in that way, they will have absolutely no doubt about the fact that the great elements that constitute the eye are selfless.

source: དེ་འདི་སྙམ་དུ་ཡང་སེམས་ཏེ། མིག་དང་གཟུགས་ལ་བརྟེན་ནས་རེག་པའི་བདག་ཏུ་གྱུར་ན་མི་རུང་ངོ་སྙམ་ནས་དེ་རླུང་དེ་ཡང་ནམ་མཁའི་ངོ་བོར་ཡང་ཚུལ་བཞིན་དུ་སོ་སོར་བརྟགས་ཏེ་དེ་ཐམས་ཅད་དུ་གང་དུ་ཡང་བདག་མི་དམིགས་སོ།
en: They will think, ‘A self that results from contact between eye and form is impossible.’ They will then also properly examine the winds and find that they have the essence of space. Having done so, they will not find a self anywhere.

source: །བརྟེན་ནས་རྣམ་པར་ཤེས་པ་འབྱུང་བ་ཡང་རྐྱེན་རྣམས་མེད་ན་མི་འབྱུང་སྟེ།
en: “They will then think, ‘A dependently arisen consciousness cannot arise in the absence of conditions.

source: མིག་དང་གཟུགས་ལ་རྟེན་ཅིང་མིག་གི་རྣམ་པར་ཤེས་པ་འབའ་ཞིག་འབྱུང་ཞིང་གཟུགས་རྣམས་ཀྱི་རྐྱེན་གྱིས་འབྱུང་ངོ་། །གྲོགས་རྣམ་པར་ཤེས་པས་མིང་དང་གཟུགས་སོ། །དེ་ལས་བྱུང་བའི་སྐྱེ་མཆེད་དྲུག་ལས་རེག་པ་དང་། ཚོར་བ་མྱོང་བ་དང་། སྲེད་པ་ལྷག་པར་ཆགས་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤིའོ།
en: Based on the eye faculty and form, only the eye consciousness arises—it arises due to the condition of form. Name and form arise in association with consciousness, and the six sense sources manifest from that. They are followed by contact, the experience of feeling, the strong attachment of craving, appropriation, becoming, birth, and old age and death.

source: །དེས་ཆོས་འདི་དག་ཐམས་ཅད་ནི་མིག་གི་རྣམ་པར་ཤེས་པ་ལ་ཡང་དག་པར་བརྟེན་པའོ།
en: Therefore, all these phenomena are dependent upon the eye consciousness.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་དེ་ཡང་ཤར་ཕྱོགས་ནས་འོངས་པ་མ་ཡིན། ལྷོ་ཕྱོགས་ནས་མ་ཡིན། ནུབ་ཕྱོགས་ནས་མ་ཡིན། བྱང་ཕྱོགས་ནས་མ་ཡིན།
en: The eye consciousness does not come from the eastern direction, the southern direction, the western direction, or the northern direction.

source: སྟེང་ནས་མ་ཡིན། འོག་ནས་མ་ཡིན་ཏེ།
en: It does not come from above or from below.

source: སྐད་ཅིག་མ་གང་ལ་མིག་གི་རྣམ་པར་ཤེས་པ་བྱུང་བའི་སྐད་ཅིག་དེ་ཡང་འགགས་སོ། །སྐད་ཅིག་མ་གཉིས་ལ་ཉེ་བར་མི་གནས་ཏེ།
en: It ceases in the same instant it arises—it does not last until the next moment.

source: འགགས་པས་གང་དུ་ཡང་འགྲོ་བ་མེད་དོ། །བསགས་པ་མེད་དོ།
en: It ceases, yet it does not go anywhere—it is without composition.

source: །ཆོས་དེ་དག་དང་འདི་དག་ཐམས་ཅད་ནི་རྐྱེན་ལས་འབྱུང་བར་སྐྱེའོ། །རྐྱེན་མ་ཚང་བས་འགག་གོ།
en: All those phenomena arise based on conditions and cease when those conditions are incomplete.

source: །གང་རྐྱེན་ལ་རག་ལས་པ་དེ་བདག་མེད་དོ།
en: That which depends on conditions is selfless.

source: །རྐྱེན་དེ་དག་ཀྱང་བྱེད་པ་པོ་མེད་པ། ཚོར་བ་པོ་མེད་པ། སློང་བ་པོ་མེད་པ། ཀུན་ནས་སློང་བ་པོ་མེད་པའོ། །དེ་བདག་མེད་པ་ཡིན་ཏེ།
en: Those conditions are also devoid of a creator, someone who experiences, a producer, or an activator—they are selfless.

source: གང་བདག་མེད་པ་དེ་བདག་དང་བདག་གིས་སྟོང་པའོ།
en: That which is selfless is empty of I and mine.

source: མིག་གི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་ཏེ།
en: Because such is the nature of the eye.

source: ཐེར་ཟུག་ཏུ་གནས་པ་མ་ཡིན་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་དེ་ལ་བདག་གམ་བདག་གི་མེད་དོ་སྙམ་མོ།
en: Since it does not remain eternally, and since it is devoid of disintegration, it is devoid of I and mine.

source: །འདི་ལ་ཇི་ལྟར་ཆོས་ཐམས་ཅད་ལེན་པ་མེད་པ་དང་། འདོར་བ་མེད་པ་དང་། ཉན་ཐོས་རྣམས་ཀྱིས་བྱས་པ་མ་ཡིན་པ་དང་། རང་རྒྱལ་བ་རྣམས་ཀྱིས་མ་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་མཛད་པ་མ་ཡིན་ཏེ།
en: All phenomena are devoid of acceptance and rejection. They are not created by the hearers, by the solitary buddhas, or by the thus-gone ones.

source: ངོ་བོ་ཉིད་ཐམས་ཅད་ཀྱི་མིག་བདག་མེད་པའོ།
en: The eye is intrinsically selfless.

source: །གང་བདག་མེད་པ་དེ་སྟོང་པའོ། །མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་སྟོང་པའོ།
en: That which is selfless is empty, and all phenomena are empty by way of not being apprehended.

source: །དེ་བཞིན་དུ་མཚན་མ་མེད་པའི་རྣམ་པར་ཐར་པའི་སྒོའི་བར་དུ་བསྒོམས་པས་ཆགས་པའི་གཞི་སྤོང་བར་འགྱུར་ཞིང་དེའི་རྒྱུ་ལས་བྱུང་བ་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་སྤོང་བར་འགྱུར་རོ།
en: Similarly, by training until reaching the gateway of liberation of the absence of marks, they will eliminate the foundation of attachment as well as all the afflictions that arise on its basis.

source: །དེའི་ཚེ་ཁ་ཅིག་ནི་བདེན་པ་དང་པོ་མངོན་པར་རྟོགས་པར་འགྱུར་རོ། །ཁ་ཅིག་ནི་བདེན་པ་བཞི་པའི་བར་མངོན་པར་རྟོགས་པར་འགྱུར་རོ།
en: At that moment, some of them will realize the first truth, and some others will realize the other truths up to the fourth one.

source: །རྣ་བ་ཞེས་བྱ་བ་ནས་སྣ་དང་ལྕེའི་བར་ལ་ཡང་དེ་བཞིན་ནོ།
en: The same goes with respect to the ear, nose, and tongue.

source: །ཡང་དེ་ལུས་ཐམས་ཅད་ལ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པས་སོ་སོར་རྟོག་པར་བྱེད་དེ།
en: “Then, they will continue their investigation by focusing carefully on their entire bodies.

source: ཁ་ཅིག་ནི་དང་པོར་སྤུ་གཅིག་ལ་ལྔ་བཅུར་རྣམ་པར་བཅད་དེ། བཅུར་བཤིག་པ་ལའོ། །གང་དག་རྟེན་པའི་སྤུ་ཐམས་ཅད་ལ་ཡང་དེ་བཞིན་ཏེ།
en: Some will first split one of their hairs into fifty parts and then further break these parts into ten pieces.

source: དེ་ལ་བདག་ཉིད་ཀྱིས་ནེམ་ནུར་མེད་པར་འགྱུར་རོ། །སྤུ་གང་ལ་ཡང་བདག་མི་དམིགས་སོ།
en: They will then repeat that process with each of their hairs, reaching the conviction that a self cannot be found within those hairs.

source: །མདོག་གི་པགས་པ་དང་། ཤ་དང་། ཁྲག་དང་། བད་ཀན་དང་། རྒྱུས་པ་དང་། རྒྱུ་མ་དང་། ཀླད་པ་དང་། རུས་པ་དང་། རྐང་དང་། དྲོ་བ་ཉིད་ལ་ཡང་དེ་བཞིན་ནོ།
en: They will then apply the same observation to their skin, flesh, blood, phlegm, ligaments, bowels, brains, bones, marrow, and bile.

source: །རླུང་གྱེན་དུ་རྒྱུ་བ་དག་དང་། ཐུར་དུ་རྒྱུ་བ་དག་དང་། བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པའི་རླུང་རྣམས་ལ་ཡང་དེ་བཞིན་དུ་ཇི་ལྟར་སྔར་བཤད་པ་བཞིན་དུ་དམིགས་པ་ཡིད་ལ་བྱེད་པ་སྟེ།
en: They will also focus their attention, in the way that has been described before, on the upward-moving winds, the downward-moving winds, and the winds that are devoid of acceptance and rejection.

source: ལུས་འདི་ལ་དེ་ལྟར་སོ་སོར་རྟོག་པར་བྱེད་དོ།
en: This is how they will investigate their bodies.

source: །སེམས་ཀྱི་བར་ལ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པས་དེ་ལྟར་སོ་སོར་རྟོག་པར་བྱེད་དོ།
en: “They will then pursue their investigation further by focusing carefully on their minds.

source: ཡིད་ལ་རྟེན་ལ་ཆོས་རྣམས་ལ་ཡང་རྟེན་ཅིང་ཡིད་འབྱུང་ངོ་།
en: They will think, ‘The mind consciousness arises based on the mind as well as mental phenomena.

source: །གྲོགས་རྣམ་པར་ཤེས་པས་མིང་དང་། གཟུགས་དང་། སྐྱེ་མཆེད་དང་། འདུས་པའི་རེག་པ་དང་། ཚོར་བ་མྱོང་བ་དང་། སྲེད་པ་ལྷག་པར་ཆགས་པ་ཉིད་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤིའོ།
en: In association with consciousness, name and form arise, followed by the six sense sources, the contact created by meeting, the experience of feeling, the strong attachment of craving, appropriation, becoming, birth, and old age and death.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་ཡང་དག་པར་རྟེན་ནས་འབྱུང་ངོ་།
en: All those phenomena therefore arise based on mind consciousness.

source: །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དེ་ཡང་ཤར་ཕྱོགས་ནས་འོངས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནས་འོག་ནས་འོངས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་བར་ཡིན་ཏེ།
en: The mind consciousness does not come from the eastern direction, [. . .] and it does not come from below.

source: སྐད་ཅིག་མ་གང་ཁོ་ན་ལ་རྐྱེན་གྱི་འདུ་འཕྲོད་ཀྱི་རྒྱུས་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་བྱུང་བའི་སྐད་ཅིག་དེ་ཡང་འགག་གོ། །སྐད་ཅིག་མ་གཉིས་པ་ལ་ཉེ་བར་མི་གནས་ཏེ།
en: Mind consciousness ceases in the very instant it arises through the gathering of conditions—it does not last until the next moment.

source: འགགས་པ་གང་དུ་ཡང་འགྲོ་བ་མེད་དོ།
en: It ceases but does not go anywhere.

source: །བསགས་པ་མེད་དོ།
en: It is devoid of composition.

source: །ཆོས་འདི་དག་ཐམས་ཅད་ནི་རྐྱེན་ལས་ཡང་དག་པར་བྱུང་བར་སྐྱེའོ། །རྐྱེན་མ་ཚང་བས་འགག་གོ།
en: All these phenomena arise based on conditions and cease when those conditions are incomplete.

source: །ཐམས་ཅད་རྐྱེན་ལ་རག་ལས་པ་ཡིན་ཏེ། དེ་དག་བདག་མེད་དོ།
en: They all depend upon conditions, and they are therefore selfless.

source: །རྐྱེན་དེ་ཡང་བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། སློང་བ་པོ་དང་། ཀུན་ནས་སློང་བ་པོ་མི་དམིགས་པ་ཉིད་པས་དེས་ན་དེ་དག་བདག་མེད་པ་ཡིན་ཏེ།
en: No creator, experiencer, producer, or activator can be found within those conditions, and those are therefore also selfless.

source: ཡིད་ཀྱི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་ཏེ།
en: Because it is the nature of the mind.

source: ཐེར་ཟུག་ཏུ་གནས་པ་མ་ཡིན་པ་དང་། འཇིག་པ་མེད་པའི་ཕྱིར་དེ་ལ་བདག་གམ་བདག་གི་མེད་དོ་སྙམ་མོ། །ཆོས་ཐམས་ཅད་སྐྱེ་བ་དང་འཇིག་པའི་ཆོས་ཉིད་ཡིན་ཏེ། འདི་ལ་ལེན་པ་མེད་དོ། །འདོར་བ་མེད་དོ།
en: Since it does not remain eternally, and since it is devoid of disintegration, it is devoid of I and mine.’ All phenomena have the nature of arising and disintegrating, and they are devoid of acceptance and rejection.

source: །དེ་ཉན་ཐོས་རྣམས་ཀྱིས་བྱས་པ་མ་ཡིན་ནོ། །རང་སངས་རྒྱས་རྣམས་ཀྱིས་མ་ཡིན་ནོ། །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་མཛད་པ་མ་ཡིན་ཏེ།
en: They have not been created by the hearers, by the solitary buddhas, or by the thus-gone ones.

source: རང་བཞིན་དང་ངོ་བོ་ཉིད་ཀྱིས་ཡིད་བདག་མེད་པའོ།
en: The mind is naturally and intrinsically selfless.

source: །གང་བདག་མེད་པ་དེ་སྟོང་པའོ། །མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་བདག་མེད་པའོ། །གང་བདག་མེད་པ་དེ་སྟོང་པའོ།
en: That which is selfless is empty, and all phenomena are selfless by way of not being apprehended.

source: །དེ་བཞིན་དུ་མཚན་མ་མེད་པའི་རྣམ་པར་ཐར་པའི་སྒོའི་བར་དུ་བསྒོམས་པས་ཆགས་པའི་གཞི་རྣམས་སྤོང་བར་འགྱུར་ཞིང་དེའི་རྒྱུ་ལས་བྱུང་བ་ཉོན་མོངས་པ་རྣམས་སྤོང་བར་འགྱུར་རོ།
en: Similarly, by training until reaching the gateway of liberation of the absence of marks, they will eliminate the foundation of attachment as well as the afflictions that arise on its basis.

source: །མཁས་པས་འདིར་དེ་ལྟར་བདག་ཡོངས་སུ་བཙལ་ནས་མི་དམིགས་པའི་ཕྱིར་ཇི་ལྟར་བདག་མེད་པ་བཞིན་རང་གི་མངོན་སུམ་དུ་འགྱུར་རོ།
en: Since the wise ones cannot find a self when they look for it, they will directly perceive phenomena by way of the absence of self.

source: །ཤཱ་རིའི་བུ་མཁས་པ་སྟོང་པ་ཉིད་ཀྱིས་གནས་པས་གནས་ཤིང་སྨོན་པ་མེད་པ་དང་། མཚན་མ་མེད་པའི་གནས་པས་གནས་ནས་དབང་པོ་བརྒྱ་བྱིན་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། མཆོད་པའི་འོས་སུ་གྱུར་པ་དང་། མངོན་པར་སྲུང་བའི་འོས་སུ་གྱུར་པ་དང་། རྗེས་སུ་དྲན་པར་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། དད་པར་བྱ་བའི་འོས་སུ་གྱུར་པ་ཡིན་ནོ།
en: “Śāriputra, since the wise ones abide by emptiness, the absence of marks, and the absence of wishes, they are worthy to be revered, worshiped, protected, remembered, and trusted by Lord Śakra and by everyone else.

source: །དབང་པོ་ཚངས་པ་ཞེས་བྱ་བ་ནས་ལྷའི་དབང་པོ་ཞེས་བྱ་བའི་བར་དང་། ཀླུའི་དབང་པོ་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་དང་། ནམ་མཁའ་ལྡིང་གི་དབང་པོ་དང་། མི་འམ་ཅིའི་དབང་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའི་བར་རྣམས་ཀྱིས་ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པ་དང་། མཆོད་པའི་འོས་སུ་གྱུར་པ་དང་། མངོན་པར་བསྲུང་བའི་འོས་སུ་གྱུར་པ་དང་། རྗེས་སུ་དྲན་པར་བྱ་བའི་འོས་སུ་གྱུར་པ་ཡིན་ནོ།
en: They are worthy to be revered, worshiped, protected, and remembered by everyone from Lord Brahmā to the rulers of the gods, the rulers of the nāgas, the rulers of the yakṣas, the rulers of the asuras, the rulers of the garuḍas, the rulers of the kinnaras, and the rulers of the mahoragas.

source: །མིའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཀྱང་དད་པར་བྱ་བའི་འོས་སུ་གྱུར་པའི་བར་དུ་ཡིན་ནོ།
en: They are also worthy to be trusted by the human rulers.

source: །ཤཱ་རིའི་བུ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བའི་གཟུངས་སྔགས་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོས་ང་ལ་གང་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོའི་ལག་ནས་བསྐུར་ཞིང་འདུས་པ་ཆེན་པོ་ཉི་མའི་སྙིང་པོ་ངས་བཤད་པ་ལ་དད་པ་སྦྱིན་པར་མཛད་པ་ཡིན་ནོ།
en: “Śāriputra, that dhāraṇī mantra peaceful core of knowledge was conferred upon me by the thus-gone Glorious Essence of Flowers through the bodhisattva Ākāśagarbha. It induces faith in The Quintessence of the Sun, which I expound in this great assembly.

source: །རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བའི་གཟུངས་སྔགས་དེ་ནི་མཐུ་ཆེ་བ་ཕན་ཡོན་ཆེ་བའོ། །སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱེད་པའོ།
en: That dhāraṇī mantra peaceful core of knowledge is powerful and beneficial—it benefits all sentient beings.

source: །ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའོ། །ཉོན་མོངས་པ་ཐམས་ཅད་འདུལ་བར་བྱེད་པའོ།
en: It completely cures all diseases and subdues all afflictions.

source: །ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་བྱེད་པའོ། །ཆོས་ཐམས་ཅད་རྣམ་པར་འབྱེད་པར་བྱེད་པའོ། །ཐབས་ཐམས་ཅད་ཡང་དག་པར་སྟོན་པར་བྱེད་པའོ། །བྱང་གྲོལ་གྱི་བདེ་བ་ཐམས་ཅད་ཡོངས་སུ་འབྱེད་པར་བྱེད་པའོ། །
en: It generates knowledge of all the aggregates, elements, and sense sources, it causes one to discern all phenomena, it reveals all skillful means, and it uncovers the entirety of the happiness of emancipation.

source: སེམས་ཅན་ཐམས་ཅད་དད་པར་བྱེད་པའོ། །ཆོས་ཐམས་ཅད་ཀྱི་བདེ་བ་ལ་འཇུག་པར་བྱེད་པའོ། །བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཆོས་དང་འཐུན་པས་ངེས་པར་ཐུལ་བར་བྱེད་པའོ། །བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་འཇིག་པར་བྱེད་པའོ། །
en: It induces faith in all sentient beings, causes one to enter the happiness related to all qualities, overcomes all māras and enemies in accordance with the Dharma, and destroys all the domains of the māras.

source: བདུད་རྣམས་ཚར་གཅོད་པར་བྱེད་པའོ། །ཕས་ཀྱི་རྒོལ་བ་རྣམས་ཕམ་པར་བྱེད་པའོ། །ལྷ་རྣམས་དགའ་བར་བྱེད་པའོ། །གནོད་སྦྱིན་རྣམས་ཡང་དག་པར་མགུ་བར་བྱེད་པའོ། །ལྷ་མ་ཡིན་རྣམས་རྣམ་པར་འཇོམས་པར་བྱེད་པའོ། །ནམ་མཁའ་ལྡིང་རྣམས་མགུ་བར་བྱེད་པའོ། །མི་འམ་ཅི་རྣམས་དད་པར་བྱེད་པའོ། །ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་རྒྱབ་ཀྱིས་ཕྱོགས་པར་བྱེད་པའོ།
en: It annihilates the māras and vanquishes the enemies, pleases the gods, delights the yakṣas, overcomes the asuras, pleases the garuḍas, causes the kinnaras to develop faith, and puts the mahoragas to flight.

source: །རྒྱལ་རིགས་རྣམས་མངོན་པར་དགའ་བར་བྱེད་པའོ། །བྲམ་ཟེ་རྣམས་འཇུག་པར་བྱེད་པའོ། །རྗེའུ་རིགས་རྣམས་རབ་ཏུ་སིམ་པར་བྱེད་པའོ། །དམངས་རིགས་རྣམས་མཆོག་ཏུ་དགའ་བར་བྱེད་པའོ། །
en: It delights the members of the kṣatriya class, induces comprehension in the brāhmaṇas, satisfies the vaiśyas, and utterly pleases the śūdras.

source: བུད་མེད་འདོད་ཆགས་དང་བྲལ་བར་བྱེད་པའོ། །བུད་མེད་སྦྲུམ་མ་བདེ་ལེགས་སུ་ཡོངས་སུ་ཐར་བར་བྱེད་པའོ། །མང་དུ་ཐོས་པ་རྣམས་དྲན་པར་བྱེད་པའོ། །རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་མངོན་པར་དགའ་བར་བྱེད་པའོ།
en: It frees women from their desires, releases pregnant women into happiness and well-being, induces recollection in the scholars, and delights the spiritual practitioners.

source: །ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའོ། །འཐབ་པ་དང་། ཐབ་མོ་དང་། མུ་གེ་དང་། མི་ངས་དང་། ནད་དང་ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་པ་དང་། ཆུ་བོ་དང་། གྲང་བ་དང་། དྲོ་བ་ཐམས་ཅད་དང་། ཁ་བ་དང་། ཚ་བ་དང་། ཧྲུད་ཧྲུད་པོ་དང་། རྩུབ་པ་དང་། རེག་པར་དཀའ་བའི་དངོས་པོ་ཐམས་ཅད་རྣམ་པར་ཞི་བར་བྱེད་པའོ།
en: It pacifies all sicknesses, quarrels, fights, famines, epidemics, diseases, hostile armies, untimely winds, rains, floods, cold, heat, snow, and heat waves, and it softens all substances that are harsh, rough, and difficult to touch.

source: །ཆོས་ཀྱི་ཚུལ་འབར་བར་བྱེད་པའོ། །སངས་རྒྱས་ཀྱི་བསྟན་པ་སྟོན་པར་བྱེད་པའོ། །དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་འཆད་པར་བྱེད་པའོ།
en: It causes the way of the Dharma to blaze, reveals the teachings of the buddhas, and ensures that the lineage of the Three Jewels remains uninterrupted.

source: །འཁོར་བས་སྐྲག་པ་རྣམས་དབུགས་འབྱིན་པར་བྱེད་པའོ། །ཟད་པ་ཤེས་པ་སྐྱེད་པར་བྱེད་པའོ། །མི་སྐྱེ་བ་ཤེས་པ་རང་གི་མངོན་སུམ་དུ་བྱེད་པའོ། །མ་རིག་པའི་མུན་པའི་ཕུང་པོ་རྣམ་པར་འདུལ་བར་བྱེད་པའོ། །སྡུག་བསྔལ་གྱི་ཁུར་འདོར་བར་བྱེད་པའོ།
en: It provides relief to those who are afraid of saṃsāra, generates the knowledge of exhaustion, actualizes the knowledge of the unborn, overcomes all the dense darkness of ignorance, and removes the burden of suffering.
